{
  "name": "Ability Scores",
  "desc": "Six abilities provide a quick description of every creature's physical\r\nand mental characteristics:\r\n\r\n-   **Strength**, measuring physical power\r\n-   **Dexterity**, measuring agility\r\n-   **Constitution**, measuring endurance\r\n-   **Intelligence**, measuring reasoning and memory\r\n-   **Wisdom**, measuring perception and insight\r\n-   **Charisma**, measuring force of personality\r\n\r\nIs a character muscle-bound and insightful? Brilliant and charming?\r\nNimble and hardy? Ability scores define these qualities---a creature's\r\nassets as well as weaknesses.\r\n\r\nThe three main rolls of the game---the ability check, the saving throw,\r\nand the attack roll---rely on the six ability scores. The book's\r\nintroduction describes the basic rule behind these rolls: roll a d20,\r\nadd an ability modifier derived from one of the six ability scores, and\r\ncompare the total to a target number.\r\n\r\n## Ability Scores and Modifiers\r\n\r\nEach of a creature's abilities has a score, a number that defines the\r\nmagnitude of that ability. An ability score is not just a measure of\r\ninnate capabilities, but also encompasses a creature's training and\r\ncompetence in activities related to that ability.\r\n\r\nA score of 10 or 11 is the normal human average, but adventurers and\r\nmany monsters are a cut above average in most abilities. A score of 18\r\nis the highest that a person usually reaches. Adventurers can have\r\nscores as high as 20, and monsters and divine beings can have scores as\r\nhigh as 30.\r\n\r\nEach ability also has a modifier, derived from the score and ranging\r\nfrom −5 (for an ability score of 1) to +10 (for a score of 30). The\r\nAbility Scores and Modifiers table notes the ability modifiers for the\r\nrange of possible ability scores, from 1 to 30.\r\n\r\n### Ability Scores and Modifiers\r\n\r\n| Score | Modifier |\r\n| --- | --- |\r\n| 1   | −5  |\r\n| 2-3 | −4  |\r\n| 4-5 | −3  |\r\n| 6-7 | −2  |\r\n| 8-9 | −1  |\r\n| 10-11 | +0  |\r\n| 12-13 | +1  |\r\n| 14-15 | +2  |\r\n| 16-17 | +3  |\r\n| 18-19 | +4  |\r\n| 20-21 | +5  |\r\n| 22-23 | +6  |\r\n| 24-25 | +7  |\r\n| 26-27 | +8  |\r\n| 28-29 | +9  |\r\n| 30  | +10 |\r\n\r\nTo determine an ability modifier without consulting the table, subtract\r\n10 from the ability score and then divide the total by 2 (round down).\r\n\r\nBecause ability modifiers affect almost every attack roll, ability\r\ncheck, and saving throw, ability modifiers come up in play more often\r\nthan their associated scores.\r\n\r\n## Advantage and Disadvantage\r\n\r\nSometimes a special ability or spell tells you that you have advantage\r\nor disadvantage on an ability check, a saving throw, or an attack roll.\r\nWhen that happens, you roll a second d20 when you make the roll. Use the\r\nhigher of the two rolls if you have advantage, and use the lower roll if\r\nyou have disadvantage. For example, if you have disadvantage and roll a\r\n17 and a 5, you use the 5. If you instead have advantage and roll those\r\nnumbers, you use the 17.\r\n\r\nIf multiple situations affect a roll and each one grants advantage or\r\nimposes disadvantage on it, you don't roll more than one additional d20.\r\nIf two favorable situations grant advantage, for example, you still roll\r\nonly one additional d20.\r\n\r\nIf circumstances cause a roll to have both advantage and disadvantage,\r\nyou are considered to have neither of them, and you roll one d20. This\r\nis true even if multiple circumstances impose disadvantage and only one\r\ngrants advantage or vice versa. In such a situation, you have neither\r\nadvantage nor disadvantage.\r\n\r\nWhen you have advantage or disadvantage and something in the game, such\r\nas the halfling's Lucky trait, lets you reroll the d20, you can reroll\r\nonly one of the dice. You choose which one. For example, if a halfling\r\nhas advantage or disadvantage on an ability check and rolls a 1 and a\r\n13, the halfling could use the Lucky trait to reroll the 1.\r\n\r\nYou usually gain advantage or disadvantage through the use of special\r\nabilities, actions, or spells. Inspiration can also give a character\r\nadvantage. The GM can also decide that circumstances influence a roll in\r\none direction or the other and grant advantage or impose disadvantage as\r\na result.\r\n\r\n## Proficiency Bonus\r\n\r\nCharacters have a proficiency bonus determined by level. Monsters also\r\nhave this bonus, which is incorporated in their stat blocks. The bonus\r\nis used in the rules on ability checks, saving throws, and attack rolls.\r\n\r\nYour proficiency bonus can't be added to a single die roll or other\r\nnumber more than once. For example, if two different rules say you can\r\nadd your proficiency bonus to a Wisdom saving throw, you nevertheless\r\nadd the bonus only once when you make the save.\r\n\r\nOccasionally, your proficiency bonus might be multiplied or divided\r\n(doubled or halved, for example) before you apply it. For example, the\r\nrogue's Expertise feature doubles the proficiency bonus for certain\r\nability checks. If a circumstance suggests that your proficiency bonus\r\napplies more than once to the same roll, you still add it only once and\r\nmultiply or divide it only once.\r\n\r\nBy the same token, if a feature or effect allows you to multiply your\r\nproficiency bonus when making an ability check that wouldn't normally\r\nbenefit from your proficiency bonus, you still don't add the bonus to\r\nthe check. For that check your proficiency bonus is 0, given the fact\r\nthat multiplying 0 by any number is still 0. For instance, if you lack\r\nproficiency in the History skill, you gain no benefit from a feature\r\nthat lets you double your proficiency bonus when you make Intelligence\r\n(History) checks.\r\n\r\nIn general, you don't multiply your proficiency bonus for attack rolls\r\nor saving throws. If a feature or effect allows you to do so, these same\r\nrules apply.\r\n\r\n## Ability Checks\r\n\r\nAn ability check tests a character's or monster's innate talent and\r\ntraining in an effort to overcome a challenge. The GM calls for an\r\nability check when a character or monster attempts an action (other than\r\nan attack) that has a chance of failure. When the outcome is uncertain,\r\nthe dice determine the results.\r\n\r\nFor every ability check, the GM decides which of the six abilities is\r\nrelevant to the task at hand and the difficulty of the task, represented\r\nby a Difficulty Class.\r\n\r\nThe more difficult a task, the higher its DC. The Typical Difficulty\r\nClasses table shows the most common DCs.\r\n\r\n### Typical Dificulty Classes\r\n\r\n| Task Difficulty | DC  |\r\n| --- | --- |\r\n| Very easy | 5   |\r\n| Easy | 10  |\r\n| Medium | 15  |\r\n| Hard | 20  |\r\n| Very hard | 25  |\r\n| Nearly impossible | 30  |\r\n\r\nTo make an ability check, roll a d20 and add the relevant ability\r\nmodifier. As with other d20 rolls, apply bonuses and penalties, and\r\ncompare the total to the DC. If the total equals or exceeds the DC, the\r\nability check is a success---the creature overcomes the challenge at\r\nhand. Otherwise, it's a failure, which means the character or monster\r\nmakes no progress toward the objective or makes progress combined with a\r\nsetback determined by the GM.\r\n\r\n### Contests\r\n\r\nSometimes one character's or monster's efforts are directly opposed to\r\nanother's. This can occur when both of them are trying to do the same\r\nthing and only one can succeed, such as attempting to snatch up a magic\r\nring that has fallen on the floor. This situation also applies when one\r\nof them is trying to prevent the other one from accomplishing a\r\ngoal---for example, when a monster tries to force open a door that an\r\nadventurer is holding closed. In situations like these, the outcome is\r\ndetermined by a special form of ability check, called a contest.\r\n\r\nBoth participants in a contest make ability checks appropriate to their\r\nefforts. They apply all appropriate bonuses and penalties, but instead\r\nof comparing the total to a DC, they compare the totals of their two\r\nchecks. The participant with the higher check total wins the contest.\r\nThat character or monster either succeeds at the action or prevents the\r\nother one from succeeding.\r\n\r\nIf the contest results in a tie, the situation remains the same as it\r\nwas before the contest. Thus, one contestant might win the contest by\r\ndefault. If two characters tie in a contest to snatch a ring off the\r\nfloor, neither character grabs it. In a contest between a monster trying\r\nto open a door and an adventurer trying to keep the door closed, a tie\r\nmeans that the door remains shut.\r\n\r\n### Skills\r\n\r\nEach ability covers a broad range of capabilities, including skills that\r\na character or a monster can be proficient in. A skill represents a\r\nspecific aspect of an ability score, and an individual's proficiency in\r\na skill demonstrates a focus on that aspect. (A character's starting\r\nskill proficiencies are determined at character creation, and a\r\nmonster's skill proficiencies appear in the monster's stat block.)\r\n\r\nFor example, a Dexterity check might reflect a character's attempt to\r\npull off an acrobatic stunt, to palm an object, or to stay hidden. Each\r\nof these aspects of Dexterity has an associated skill: Acrobatics,\r\nSleight of Hand, and Stealth, respectively. So a character who has\r\nproficiency in the Stealth skill is particularly good at Dexterity\r\nchecks related to sneaking and hiding.\r\n\r\nThe skills related to each ability score are shown in the following\r\nlist. (No skills are related to Constitution.) See an ability's\r\ndescription in the later sections of this section for examples of how to\r\nuse a skill associated with an ability.\r\n\r\n**Strength** - Athletics\r\n\r\n**Dexterity** - Acrobatics - Sleight of Hand - Stealth\r\n\r\n**Intelligence** - Arcana - History - Investigation - Nature - Religion\r\n\r\n**Wisdom** - Animal Handling - Insight - Medicine - Perception -\r\nSurvival\r\n\r\n**Charisma** - Deception - Intimidation - Performance - Persuasion\r\n\r\nSometimes, the GM might ask for an ability check using a specific\r\nskill---for example, \"Make a Wisdom (Perception) check.\" At other times,\r\na player might ask the GM if proficiency in a particular skill applies\r\nto a check. In either case, proficiency in a skill means an individual\r\ncan add his or her proficiency bonus to ability checks that involve that\r\nskill. Without proficiency in the skill, the individual makes a normal\r\nability check.\r\n\r\nFor example, if a character attempts to climb up a dangerous cliff, the\r\nGM might ask for a Strength (Athletics) check. If the character is\r\nproficient in Athletics, the character's proficiency bonus is added to\r\nthe Strength check. If the character lacks that proficiency, he or she\r\njust makes a Strength check.\r\n\r\n#### Variant: Skills with Different Abilities\r\n\r\nNormally, your proficiency in a skill applies only to a specific kind of\r\nability check. Proficiency in Athletics, for example, usually applies to\r\nStrength checks. In some situations, though, your proficiency might\r\nreasonably apply to a different kind of check. In such cases, the GM\r\nmight ask for a check using an unusual combination of ability and skill,\r\nor you might ask your GM if you can apply a proficiency to a different\r\ncheck. For example, if you have to swim from an offshore island to the\r\nmainland, your GM might call for a Constitution check to see if you have\r\nthe stamina to make it that far. In this case, your GM might allow you\r\nto apply your proficiency in Athletics and ask for a Constitution\r\n(Athletics) check. So if you're proficient in Athletics, you apply your\r\nproficiency bonus to the Constitution check just as you would normally\r\ndo for a Strength (Athletics) check. Similarly, when your half-orc\r\nbarbarian uses a display of raw strength to intimidate an enemy, your GM\r\nmight ask for a Strength (Intimidation) check, even though Intimidation\r\nis normally associated with Charisma.\r\n\r\n### Passive Checks\r\n\r\nA passive check is a special kind of ability check that doesn't involve\r\nany die rolls. Such a check can represent the average result for a task\r\ndone repeatedly, such as searching for secret doors over and over again,\r\nor can be used when the GM wants to secretly determine whether the\r\ncharacters succeed at something without rolling dice, such as noticing a\r\nhidden monster.\r\n\r\nHere's how to determine a character's total for a passive check:\r\n\r\n> 10 + all modifiers that normally apply to the check\r\n\r\nIf the character has advantage on the check, add 5. For disadvantage,\r\nsubtract 5. The game refers to a passive check total as a **score**.\r\n\r\nFor example, if a 1st-level character has a Wisdom of 15 and proficiency\r\nin Perception, he or she has a passive Wisdom (Perception) score of 14.\r\n\r\nThe rules on hiding in the \"Dexterity\" section below rely on passive\r\nchecks, as do the exploration rules.\r\n\r\n### Working Together\r\n\r\nSometimes two or more characters team up to attempt a task. The\r\ncharacter who's leading the effort---or the one with the highest ability\r\nmodifier---can make an ability check with advantage, reflecting the help\r\nprovided by the other characters. In combat, this requires the Help\r\naction.\r\n\r\nA character can only provide help if the task is one that he or she\r\ncould attempt alone. For example, trying to open a lock requires\r\nproficiency with thieves' tools, so a character who lacks that\r\nproficiency can't help another character in that task. Moreover, a\r\ncharacter can help only when two or more individuals working together\r\nwould actually be productive. Some tasks, such as threading a needle,\r\nare no easier with help.\r\n\r\n#### Group Checks\r\n\r\nWhen a number of individuals are trying to accomplish something as a\r\ngroup, the GM might ask for a group ability check. In such a situation,\r\nthe characters who are skilled at a particular task help cover those who\r\naren't.\r\n\r\nTo make a group ability check, everyone in the group makes the ability\r\ncheck. If at least half the group succeeds, the whole group succeeds.\r\nOtherwise, the group fails.\r\n\r\nGroup checks don't come up very often, and they're most useful when all\r\nthe characters succeed or fail as a group. For example, when adventurers\r\nare navigating a swamp, the GM might call for a group Wisdom (Survival)\r\ncheck to see if the characters can avoid the quicksand, sinkholes, and\r\nother natural hazards of the environment. If at least half the group\r\nsucceeds, the successful characters are able to guide their companions\r\nout of danger. Otherwise, the group stumbles into one of these hazards.\r\n\r\n## Using Each Ability\r\n\r\nEvery task that a character or monster might attempt in the game is\r\ncovered by one of the six abilities. This section explains in more\r\ndetail what those abilities mean and the ways they are used in the game.\r\n\r\n### Strength\r\n\r\nStrength measures bodily power, athletic training, and the extent to\r\nwhich you can exert raw physical force.\r\n\r\n#### Strength Checks\r\n\r\nA Strength check can model any attempt to lift, push, pull, or break\r\nsomething, to force your body through a space, or to otherwise apply\r\nbrute force to a situation. The Athletics skill reflects aptitude in\r\ncertain kinds of Strength checks.\r\n\r\n##### Athletics\r\n\r\nYour Strength (Athletics) check covers difficult situations you\r\nencounter while climbing, jumping, or swimming. Examples include the\r\nfollowing activities:\r\n\r\n-   You attempt to climb a sheer or slippery cliff, avoid hazards while\r\n    scaling a wall, or cling to a surface while something is trying to\r\n    knock you off.\r\n-   You try to jump an unusually long distance or pull off a stunt\r\n    midjump.\r\n-   You struggle to swim or stay afloat in treacherous currents,\r\n    storm-tossed waves, or areas of thick seaweed. Or another creature\r\n    tries to push or pull you underwater or otherwise interfere with\r\n    your swimming.\r\n\r\n##### Other Strength Checks\r\n\r\nThe GM might also call for a Strength check when you try to accomplish\r\ntasks like the following:\r\n\r\n-   Force open a stuck, locked, or barred door\r\n-   Break free of bonds\r\n-   Push through a tunnel that is too small\r\n-   Hang on to a wagon while being dragged behind it\r\n-   Tip over a statue\r\n-   Keep a boulder from rolling\r\n\r\n#### Attack Rolls and Damage\r\n\r\nYou add your Strength modifier to your attack roll and your damage roll\r\nwhen attacking with a melee weapon such as a mace, a battleaxe, or a\r\njavelin. You use melee weapons to make melee attacks in hand-to-hand\r\ncombat, and some of them can be thrown to make a ranged attack.\r\n\r\n#### Lifting and Carrying\r\n\r\nYour Strength score determines the amount of weight you can bear. The\r\nfollowing terms define what you can lift or carry.\r\n\r\n**Carrying Capacity.** Your carrying capacity is your Strength score\r\nmultiplied by 15. This is the weight (in pounds) that you can carry,\r\nwhich is high enough that most characters don't usually have to worry\r\nabout it.\r\n\r\n**Push, Drag, or Lift.** You can push, drag, or lift a weight in pounds\r\nup to twice your carrying capacity (or 30 times your Strength score).\r\nWhile pushing or dragging weight in excess of your carrying capacity,\r\nyour speed drops to 5 feet.\r\n\r\n**Size and Strength.** Larger creatures can bear more weight, whereas\r\nTiny creatures can carry less. For each size category above Medium,\r\ndouble the creature's carrying capacity and the amount it can push,\r\ndrag, or lift. For a Tiny creature, halve these weights.\r\n\r\n#### Variant: Encumbrance\r\n\r\nThe rules for lifting and carrying are intentionally simple. Here is a\r\nvariant if you are looking for more detailed rules for determining how a\r\ncharacter is hindered by the weight of equipment. When you use this\r\nvariant, ignore the Strength column of the Armor table.\r\n\r\nIf you carry weight in excess of 5 times your Strength score, you are\r\n**encumbered**, which means your speed drops by 10 feet.\r\n\r\nIf you carry weight in excess of 10 times your Strength score, up to\r\nyour maximum carrying capacity, you are instead **heavily encumbered**,\r\nwhich means your speed drops by 20 feet and you have disadvantage on\r\nability checks, attack rolls, and saving throws that use Strength,\r\nDexterity, or Constitution.\r\n\r\n### Dexterity\r\n\r\nDexterity measures agility, reflexes, and balance.\r\n\r\n#### Dexterity Checks\r\n\r\nA Dexterity check can model any attempt to move nimbly, quickly, or\r\nquietly, or to keep from falling on tricky footing. The Acrobatics,\r\nSleight of Hand, and Stealth skills reflect aptitude in certain kinds of\r\nDexterity checks.\r\n\r\n##### Acrobatics\r\n\r\nYour Dexterity (Acrobatics) check covers your attempt to stay on your\r\nfeet in a tricky situation, such as when you're trying to run across a\r\nsheet of ice, balance on a tightrope, or stay upright on a rocking\r\nship's deck. The GM might also call for a Dexterity (Acrobatics) check\r\nto see if you can perform acrobatic stunts, including dives, rolls,\r\nsomersaults, and flips.\r\n\r\n##### Sleight of Hand\r\n\r\nWhenever you attempt an act of legerdemain or manual trickery, such as\r\nplanting something on someone else or concealing an object on your\r\nperson, make a Dexterity (Sleight of Hand) check. The GM might also call\r\nfor a Dexterity (Sleight of Hand) check to determine whether you can\r\nlift a coin purse off another person or slip something out of another\r\nperson's pocket.\r\n\r\n##### Stealth\r\n\r\nMake a Dexterity (Stealth) check when you attempt to conceal yourself\r\nfrom enemies, slink past guards, slip away without being noticed, or\r\nsneak up on someone without being seen or heard.\r\n\r\n##### Other Dexterity Checks\r\n\r\nThe GM might call for a Dexterity check when you try to accomplish tasks\r\nlike the following:\r\n\r\n-   Control a heavily laden cart on a steep descent\r\n-   Steer a chariot around a tight turn\r\n-   Pick a lock\r\n-   Disable a trap\r\n-   Securely tie up a prisoner\r\n-   Wriggle free of bonds\r\n-   Play a stringed instrument\r\n-   Craft a small or detailed object\r\n\r\n**Hiding**\r\n\r\nThe GM decides when circumstances are appropriate for hiding. When you\r\ntry to hide, make a Dexterity (Stealth) check. Until you are discovered\r\nor you stop hiding, that check's total is contested by the Wisdom\r\n(Perception) check of any creature that actively searches for signs of\r\nyour presence.\r\n\r\nYou can't hide from a creature that can see you clearly, and you give\r\naway your position if you make noise, such as shouting a warning or\r\nknocking over a vase.\r\n\r\nAn invisible creature can always try to hide. Signs of its passage might\r\nstill be noticed, and it does have to stay quiet.\r\n\r\nIn combat, most creatures stay alert for signs of danger all around, so\r\nif you come out of hiding and approach a creature, it usually sees you.\r\nHowever, under certain circumstances, the GM might allow you to stay\r\nhidden as you approach a creature that is distracted, allowing you to\r\ngain advantage on an attack roll before you are seen.\r\n\r\n**Passive Perception.** When you hide, there's a chance someone will\r\nnotice you even if they aren't searching. To determine whether such a\r\ncreature notices you, the GM compares your Dexterity (Stealth) check\r\nwith that creature's passive Wisdom (Perception) score, which equals 10\r\n+ the creature's Wisdom modifier, as well as any other bonuses or\r\npenalties. If the creature has advantage, add 5. For disadvantage,\r\nsubtract 5. For example, if a 1st-level character (with a proficiency\r\nbonus of +2) has a Wisdom of 15 (a +2 modifier) and proficiency in\r\nPerception, he or she has a passive Wisdom (Perception) of 14.\r\n\r\n**What Can You See?** One of the main factors in determining whether you\r\ncan find a hidden creature or object is how well you can see in an area,\r\nwhich might be **lightly** or **heavily obscured**, as explained in\r\n`srd:the-environment`.\r\n\r\n#### Attack Rolls and Damage\r\n\r\nYou add your Dexterity modifier to your attack roll and your damage roll\r\nwhen attacking with a ranged weapon, such as a sling or a longbow. You\r\ncan also add your Dexterity modifier to your attack roll and your damage\r\nroll when attacking with a melee weapon that has the finesse property,\r\nsuch as a dagger or a rapier.\r\n\r\n#### Armor Class\r\n\r\nDepending on the armor you wear, you might add some or all of your\r\nDexterity modifier to your Armor Class.\r\n\r\n#### Initiative\r\n\r\nAt the beginning of every combat, you roll initiative by making a\r\nDexterity check. Initiative determines the order of creatures' turns in\r\ncombat.\r\n\r\n### Constitution\r\n\r\nConstitution measures health, stamina, and vital force.\r\n\r\n#### Constitution Checks\r\n\r\nConstitution checks are uncommon, and no skills apply to Constitution\r\nchecks, because the endurance this ability represents is largely passive\r\nrather than involving a specific effort on the part of a character or\r\nmonster. A Constitution check can model your attempt to push beyond\r\nnormal limits, however.\r\n\r\nThe GM might call for a Constitution check when you try to accomplish\r\ntasks like the following:\r\n\r\n-   Hold your breath\r\n-   March or labor for hours without rest\r\n-   Go without sleep\r\n-   Survive without food or water\r\n-   Quaff an entire stein of ale in one go\r\n\r\n#### Hit Points\r\n\r\nYour Constitution modifier contributes to your hit points. Typically,\r\nyou add your Constitution modifier to each Hit Die you roll for your hit\r\npoints.\r\n\r\nIf your Constitution modifier changes, your hit point maximum changes as\r\nwell, as though you had the new modifier from 1st level. For example, if\r\nyou raise your Constitution score when you reach 4th level and your\r\nConstitution modifier increases from +1 to +2, you adjust your hit point\r\nmaximum as though the modifier had always been +2. So you add 3 hit\r\npoints for your first three levels, and then roll your hit points for\r\n4th level using your new modifier. Or if you're 7th level and some\r\neffect lowers your Constitution score so as to reduce your Constitution\r\nmodifier by 1, your hit point maximum is reduced by 7.\r\n\r\n### Intelligence\r\n\r\nIntelligence measures mental acuity, accuracy of recall, and the ability\r\nto reason.\r\n\r\n#### Intelligence Checks\r\n\r\nAn Intelligence check comes into play when you need to draw on logic,\r\neducation, memory, or deductive reasoning. The Arcana, History,\r\nInvestigation, Nature, and Religion skills reflect aptitude in certain\r\nkinds of Intelligence checks.\r\n\r\n##### Arcana\r\n\r\nYour Intelligence (Arcana) check measures your ability to recall lore\r\nabout spells, magic items, eldritch symbols, magical traditions, the\r\nplanes of existence, and the inhabitants of those planes.\r\n\r\n##### History\r\n\r\nYour Intelligence (History) check measures your ability to recall lore\r\nabout historical events, legendary people, ancient kingdoms, past\r\ndisputes, recent wars, and lost civilizations.\r\n\r\n##### Investigation\r\n\r\nWhen you look around for clues and make deductions based on those clues,\r\nyou make an Intelligence (Investigation) check. You might deduce the\r\nlocation of a hidden object, discern from the appearance of a wound what\r\nkind of weapon dealt it, or determine the weakest point in a tunnel that\r\ncould cause it to collapse. Poring through ancient scrolls in search of\r\na hidden fragment of knowledge might also call for an Intelligence\r\n(Investigation) check.\r\n\r\n##### Nature\r\n\r\nYour Intelligence (Nature) check measures your ability to recall lore\r\nabout terrain, plants and animals, the weather, and natural cycles.\r\n\r\n##### Religion\r\n\r\nYour Intelligence (Religion) check\r\n\r\nmeasures your ability to recall lore about deities, rites and prayers,\r\nreligious hierarchies, holy symbols, and the practices of secret cults.\r\n\r\n##### Other Intelligence Checks\r\n\r\nThe GM might call for an Intelligence check when you try to accomplish\r\ntasks like the following:\r\n\r\n-   Communicate with a creature without using words\r\n-   Estimate the value of a precious item\r\n-   Pull together a disguise to pass as a city guard\r\n-   Forge a document\r\n-   Recall lore about a craft or trade\r\n-   Win a game of skill\r\n\r\n#### Spellcasting Ability\r\n\r\nWizards use Intelligence as their spellcasting ability, which helps\r\ndetermine the saving throw DCs of spells they cast.\r\n\r\n### Wisdom\r\n\r\nWisdom reflects how attuned you are to the world around you and\r\nrepresents perceptiveness and intuition.\r\n\r\n#### Wisdom Checks\r\n\r\nA Wisdom check might reflect an effort to read body language, understand\r\nsomeone's feelings, notice things about the environment, or care for an\r\ninjured person. The Animal Handling, Insight, Medicine, Perception, and\r\nSurvival skills reflect aptitude in certain kinds of Wisdom checks.\r\n\r\n##### Animal Handling\r\n\r\nWhen there is any question whether you can calm down a domesticated\r\nanimal, keep a mount from getting spooked, or intuit an animal's\r\nintentions, the GM might call for a Wisdom (Animal Handling) check. You\r\nalso make a Wisdom (Animal Handling) check to control your mount when\r\nyou attempt a risky maneuver.\r\n\r\n##### Insight\r\n\r\nYour Wisdom (Insight) check decides whether you can determine the true\r\nintentions of a creature, such as when searching out a lie or predicting\r\nsomeone's next move. Doing so involves gleaning clues from body\r\nlanguage, speech habits, and changes in mannerisms.\r\n\r\n##### Medicine\r\n\r\nA Wisdom (Medicine) check lets you try to stabilize a dying companion or\r\ndiagnose an illness.\r\n\r\n##### Perception\r\n\r\nYour Wisdom (Perception) check lets you spot, hear, or otherwise detect\r\nthe presence of something. It measures your general awareness of your\r\nsurroundings and the keenness of your senses. For example, you might try\r\nto hear a conversation through a closed door, eavesdrop under an open\r\nwindow, or hear monsters moving stealthily in the forest. Or you might\r\ntry to spot things that are obscured or easy to miss, whether they are\r\norcs lying in ambush on a road, thugs hiding in the shadows of an alley,\r\nor candlelight under a closed secret door.\r\n\r\n##### Survival\r\n\r\nThe GM might ask you to make a Wisdom (Survival) check to follow tracks,\r\nhunt wild game, guide your group through frozen wastelands, identify\r\nsigns that owlbears live nearby, predict the weather, or avoid quicksand\r\nand other natural hazards.\r\n\r\n##### Other Wisdom Checks\r\n\r\nThe GM might call for a Wisdom check when you try to accomplish tasks\r\nlike the following:\r\n\r\n-   Get a gut feeling about what course of action to follow\r\n-   Discern whether a seemingly dead or living creature is undead\r\n\r\n#### Spellcasting Ability\r\n\r\nClerics, druids, and rangers use Wisdom as their spellcasting ability,\r\nwhich helps determine the saving throw DCs of spells they cast.\r\n\r\n### Charisma\r\n\r\nCharisma measures your ability to interact effectively with others. It\r\nincludes such factors as confidence and eloquence, and it can represent\r\na charming or commanding personality.\r\n\r\n#### Charisma Checks\r\n\r\nA Charisma check might arise when you try to influence or entertain\r\nothers, when you try to make an impression or tell a convincing lie, or\r\nwhen you are navigating a tricky social situation. The Deception,\r\nIntimidation, Performance, and Persuasion skills reflect aptitude in\r\ncertain kinds of Charisma checks.\r\n\r\n##### Deception\r\n\r\nYour Charisma (Deception) check determines whether you can convincingly\r\nhide the truth, either verbally or through your actions. This deception\r\ncan encompass everything from misleading others through ambiguity to\r\ntelling outright lies. Typical situations include trying to fast-talk a\r\nguard, con a merchant, earn money through gambling, pass yourself off in\r\na disguise, dull someone's suspicions with false assurances, or maintain\r\na straight face while telling a blatant lie.\r\n\r\n##### Intimidation\r\n\r\nWhen you attempt to influence someone through overt threats, hostile\r\nactions, and physical violence, the GM might ask you to make a Charisma\r\n(Intimidation) check. Examples include trying to pry information out of\r\na prisoner, convincing street thugs to back down from a confrontation,\r\nor using the edge of a broken bottle to convince a sneering vizier to\r\nreconsider a decision.\r\n\r\n##### Performance\r\n\r\nYour Charisma (Performance) check determines how well you can delight an\r\naudience with music, dance, acting, storytelling, or some other form of\r\nentertainment.\r\n\r\n##### Persuasion\r\n\r\nWhen you attempt to influence someone or a group of people with tact,\r\nsocial graces, or good nature, the GM might ask you to make a Charisma\r\n(Persuasion) check. Typically, you use persuasion when acting in good\r\nfaith, to foster friendships, make cordial requests, or exhibit proper\r\netiquette. Examples of persuading others include convincing a\r\nchamberlain to let your party see the king, negotiating peace between\r\nwarring tribes, or inspiring a crowd of townsfolk.\r\n\r\n##### Other Charisma Checks\r\n\r\nThe GM might call for a Charisma check when you try to accomplish tasks\r\nlike the following:\r\n\r\n-   Find the best person to talk to for news, rumors, and gossip\r\n-   Blend into a crowd to get the sense of key topics of conversation\r\n\r\n#### Spellcasting Ability\r\n\r\nBards, paladins, sorcerers, and warlocks use Charisma as their\r\nspellcasting ability, which helps determine the saving throw DCs of\r\nspells they cast.",
  "image": "/assets/gameplay/ability-scores-avatar.png",
  "bg": "/assets/gameplay/gameplay-bg.png"
}
