{
  "name": "Between Adventures",
  "desc": "Between trips to dungeons and battles against ancient evils, adventurers\r\nneed time to rest, recuperate, and prepare for their next adventure.\r\nMany adventurers also use this time to perform other tasks, such as\r\ncrafting arms and armor, performing research, or spending their\r\nhard-earned gold.\r\n\r\nIn some cases, the passage of time is something that occurs with little\r\nfanfare or description. When starting a new adventure, the GM might\r\nsimply declare that a certain amount of time has passed and allow you to\r\ndescribe in general terms what your character has been doing. At other\r\ntimes, the GM might want to keep track of just how much time is passing\r\nas events beyond your perception stay in motion.\r\n\r\n## Lifestyle Expenses\r\n\r\nBetween adventures, you choose a particular quality of life and pay the\r\ncost of maintaining that lifestyle.\r\n\r\nLiving a particular lifestyle doesn't have a huge effect on your\r\ncharacter, but your lifestyle can affect the way other individuals and\r\ngroups react to you. For example, when you lead an aristocratic\r\nlifestyle, it might be easier for you to influence the nobles of the\r\ncity than if you live in poverty.\r\n\r\n## Downtime Activities\r\n\r\nBetween adventures, the GM might ask you what your character is doing\r\nduring his or her downtime. Periods of downtime can vary in duration,\r\nbut each downtime activity requires a certain number of days to complete\r\nbefore you gain any benefit, and at least 8 hours of each day must be\r\nspent on the downtime activity for the day to count. The days do not\r\nneed to be consecutive. If you have more than the minimum amount of days\r\nto spend, you can keep doing the same thing for a longer period of time,\r\nor switch to a new downtime activity.\r\n\r\nDowntime activities other than the ones presented below are possible. If\r\nyou want your character to spend his or her downtime performing an\r\nactivity not covered here, discuss it with your GM.\r\n\r\n### Crafting\r\n\r\nYou can craft nonmagical objects, including adventuring equipment and\r\nworks of art. You must be proficient with tools related to the object\r\nyou are trying to create (typically artisan's tools). You might also\r\nneed access to special materials or locations necessary to create it.\r\nFor example, someone proficient with smith's tools needs a forge in\r\norder to craft a sword or suit of armor.\r\n\r\nFor every day of downtime you spend crafting, you can craft one or more\r\nitems with a total market value not exceeding 5 gp, and you must expend\r\nraw materials worth half the total market value. If something you want\r\nto craft has a market value greater than 5 gp, you make progress every\r\nday in 5- gp increments until you reach the market value of the item.\r\nFor example, a suit of plate armor (market value 1,500 gp) takes 300\r\ndays to craft by yourself.\r\n\r\nMultiple characters can combine their efforts toward the crafting of a\r\nsingle item, provided that the characters all have proficiency with the\r\nrequisite tools and are working together in the same place. Each\r\ncharacter contributes 5 gp worth of effort for every day spent helping\r\nto craft the item. For example, three characters with the requisite tool\r\nproficiency and the proper facilities can craft a suit of plate armor in\r\n100 days, at a total cost of 750 gp.\r\n\r\nWhile crafting, you can maintain a modest lifestyle without having to\r\npay 1 gp per day, or a comfortable lifestyle at half the normal cost.\r\n\r\n### Practicing a Profession\r\n\r\nYou can work between adventures, allowing you to maintain a modest\r\nlifestyle without having to pay 1 gp per day. This benefit lasts as long\r\nyou continue to practice your profession.\r\n\r\nIf you are a member of an organization that can provide gainful\r\nemployment, such as a temple or a thieves' guild, you earn enough to\r\nsupport a comfortable lifestyle instead.\r\n\r\nIf you have proficiency in the Performance skill and put your\r\nperformance skill to use during your downtime, you earn enough to\r\nsupport a wealthy lifestyle instead.\r\n\r\n### Recuperating\r\n\r\nYou can use downtime between adventures to recover from a debilitating\r\ninjury, disease, or poison.\r\n\r\nAfter three days of downtime spent recuperating, you can make a DC 15\r\nConstitution saving throw. On a successful save, you can choose one of\r\nthe following results:\r\n\r\n-   End one effect on you that prevents you from regaining hit points.\r\n-   For the next 24 hours, gain advantage on saving throws against one\r\n    disease or poison currently affecting you.\r\n\r\n### Researching\r\n\r\nThe time between adventures is a great chance to perform research,\r\ngaining insight into mysteries that have unfurled over the course of the\r\ncampaign. Research can include poring over dusty tomes and crumbling\r\nscrolls in a library or buying drinks for the locals to pry rumors and\r\ngossip from their lips.\r\n\r\nWhen you begin your research, the GM determines whether the information\r\nis available, how many days of downtime it will take to find it, and\r\nwhether there are any restrictions on your research (such as needing to\r\nseek out a specific individual, tome, or location). The GM might also\r\nrequire you to make one or more ability checks, such as an Intelligence\r\n(Investigation) check to find clues pointing toward the information you\r\nseek, or a Charisma (Persuasion) check to secure someone's aid. Once\r\nthose conditions are met, you learn the information if it is available.\r\n\r\nFor each day of research, you must spend 1 gp to cover your expenses.\r\nThis cost is in addition to your normal lifestyle expenses.\r\n\r\n### Training\r\n\r\nYou can spend time between adventures learning a new language or\r\ntraining with a set of tools. Your GM might allow additional training\r\noptions.\r\n\r\nFirst, you must find an instructor willing to teach you. The GM\r\ndetermines how long it takes, and whether one or more ability checks are\r\nrequired.\r\n\r\nThe training lasts for 250 days and costs 1 gp per day. After you spend\r\nthe requisite amount of time and money, you learn the new language or\r\ngain proficiency with the new tool.",
  "image": "/assets/gameplay/between-adventures-avatar.png",
  "bg": "/assets/gameplay/gameplay-bg.png"
}
