{
  "name": "Environment",
  "desc": "By its nature, adventuring involves delving into places that are dark,\r\ndangerous, and full of mysteries to be explored. The rules in this\r\nsection cover some of the most important ways in which adventurers\r\ninteract with the environment in such places.\r\n\r\n## Falling\r\n\r\nA fall from a great height is one of the most common hazards facing an\r\nadventurer. At the end of a fall, a creature takes 1d6 bludgeoning\r\ndamage for every 10 feet it fell, to a maximum of 20d6. The creature\r\nlands `srd:prone`, unless it avoids taking damage from the fall.\r\n\r\n## Suffocating\r\n\r\nA creature can hold its breath for a number of minutes equal to 1 + its\r\nConstitution modifier (minimum of 30 seconds).\r\n\r\nWhen a creature runs out of breath or is choking, it can survive for a\r\nnumber of rounds equal to its Constitution modifier (minimum of 1\r\nround). At the start of its next turn, it drops to 0 hit points and is\r\ndying, and it can't regain hit points or be stabilized until it can\r\nbreathe again.\r\n\r\nFor example, a creature with a Constitution of 14 can hold its breath\r\nfor 3 minutes. If it starts suffocating, it has 2 rounds to reach air\r\nbefore it drops to 0 hit points.\r\n\r\n## Vision and Light\r\n\r\nThe most fundamental tasks of adventuring---noticing danger, finding\r\nhidden objects, hitting an enemy in combat, and targeting a spell, to\r\nname just a few---rely heavily on a character's ability to see. Darkness\r\nand other effects that obscure vision can prove a significant hindrance.\r\n\r\nA given area might be lightly or heavily obscured. In a \\*\\*lightly\r\nobscured\\*\\* area, such as dim light, patchy fog, or moderate foliage,\r\ncreatures have disadvantage on Wisdom (Perception) checks that rely on\r\nsight.\r\n\r\nA **heavily obscured** area---such as darkness, opaque fog, or dense\r\nfoliage---blocks vision entirely. A creature effectively suffers from\r\nthe `srd:blinded` condition when trying to see something in that area.\r\n\r\nThe presence or absence of light in an environment creates three\r\ncategories of illumination: bright light, dim light, and darkness.\r\n\r\n**Bright light** lets most creatures see normally. Even gloomy days\r\nprovide bright light, as do torches, lanterns, fires, and other sources\r\nof illumination within a specific radius.\r\n\r\n**Dim light**, also called shadows, creates a lightly obscured area. An\r\narea of dim light is usually a boundary between a source of bright\r\nlight, such as a torch, and surrounding darkness. The soft light of\r\ntwilight and dawn also counts as dim light. A particularly brilliant\r\nfull moon might bathe the land in dim light.\r\n\r\n**Darkness** creates a heavily obscured area. Characters face darkness\r\noutdoors at night (even most moonlit nights), within the confines of an\r\nunlit dungeon or a subterranean vault, or in an area of magical\r\ndarkness.\r\n\r\n### Blindsight\r\n\r\nA creature with blindsight can perceive its surroundings without relying\r\non sight, within a specific radius. Creatures without eyes, such as\r\noozes, and creatures with echolocation or heightened senses, such as\r\nbats and true dragons, have this sense.\r\n\r\n### Darkvision\r\n\r\nMany creatures in fantasy gaming worlds, especially those that dwell\r\nunderground, have darkvision. Within a specified range, a creature with\r\ndarkvision can see in darkness as if the darkness were dim light, so\r\nareas of darkness are only lightly obscured as far as that creature is\r\nconcerned. However, the creature can't discern color in darkness, only\r\nshades of gray.\r\n\r\n### Truesight\r\n\r\nA creature with truesight can, out to a specific range, see in normal\r\nand magical darkness, see `srd:invisible` creatures and objects,\r\nautomatically detect visual illusions and succeed on saving throws\r\nagainst them, and perceives the original form of a shapechanger or a\r\ncreature that is transformed by magic. Furthermore, the creature can see\r\ninto the Ethereal Plane.\r\n\r\n## Food and Water\r\n\r\nCharacters who don't eat or drink suffer the effects of\r\n`srd:exhaustion`. Exhaustion caused by lack of food or water can't be\r\nremoved until the character eats and drinks the full required amount.\r\n\r\n### Food\r\n\r\nA character needs one pound of food per day and can make food last\r\nlonger by subsisting on half rations. Eating half a pound of food in a\r\nday counts as half a day without food.\r\n\r\nA character can go without food for a number of days equal to 3 + his or\r\nher Constitution modifier (minimum 1). At the end of each day beyond\r\nthat limit, a character automatically suffers one level of\r\n`srd:exhaustion`.\r\n\r\nA normal day of eating resets the count of days without food to zero.\r\n\r\n### Water\r\n\r\nA character needs one gallon of water per day, or two gallons per day if\r\nthe weather is hot. A character who drinks only half that much water\r\nmust succeed on a DC 15 Constitution saving throw or suffer one level of\r\n`srd:exhaustion` at the end of the day. A character with access to even\r\nless water automatically suffers one level of `srd:exhaustion` at the\r\nend of the day.\r\n\r\nIf the character already has one or more levels of `srd:exhaustion`, the\r\ncharacter takes two levels in either case.\r\n\r\n## Interacting with Objects\r\n\r\nA character's interaction with objects in an environment is often simple\r\nto resolve in the game. The player tells the GM that his or her\r\ncharacter is doing something, such as moving a lever, and the GM\r\ndescribes what, if anything, happens.\r\n\r\nFor example, a character might decide to pull a lever, which might, in\r\nturn, raise a portcullis, cause a room to flood with water, or open a\r\nsecret door in a nearby wall. If the lever is rusted in position,\r\nthough, a character might need to force it. In such a situation, the GM\r\nmight call for a Strength check to see whether the character can wrench\r\nthe lever into place. The GM sets the DC for any such check based on the\r\ndifficulty of the task.\r\n\r\nCharacters can also damage objects with their weapons and spells.\r\nObjects are immune to poison and psychic damage, but otherwise they can\r\nbe affected by physical and magical attacks much like creatures can. The\r\nGM determines an object's Armor Class and hit points, and might decide\r\nthat certain objects have resistance or immunity to certain kinds of\r\nattacks. (It's hard to cut a rope with a club, for example.) Objects\r\nalways fail Strength and Dexterity saving throws, and they are immune to\r\neffects that require other saves. When an object drops to 0 hit points,\r\nit breaks.\r\n\r\nA character can also attempt a Strength check to break an object. The GM\r\nsets the DC for any such check.",
  "image": "/assets/gameplay/environment-avatar.png",
  "bg": "/assets/gameplay/gameplay-bg.png"
}
