{
  "name": "Rest",
  "desc": "Heroic though they might be, adventurers can't spend every hour of the\r\nday in the thick of exploration, social interaction, and combat. They\r\nneed rest---time to sleep and eat, tend their wounds, refresh their\r\nminds and spirits for spellcasting, and brace themselves for further\r\nadventure.\r\n\r\nAdventurers can take short rests in the midst of an adventuring day and\r\na long rest to end the day.\r\n\r\n## Short Rest\r\n\r\nA short rest is a period of downtime, at least 1 hour long, during which\r\na character does nothing more strenuous than eating, drinking, reading,\r\nand tending to wounds.\r\n\r\nA character can spend one or more Hit Dice at the end of a short rest,\r\nup to the character's maximum number of Hit Dice, which is equal to the\r\ncharacter's level. For each Hit Die spent in this way, the player rolls\r\nthe die and adds the character's Constitution modifier to it. The\r\ncharacter regains hit points equal to the total. The player can decide\r\nto spend an additional Hit Die after each roll. A character regains some\r\nspent Hit Dice upon finishing a long rest, as explained below.\r\n\r\n## Long Rest\r\n\r\nA long rest is a period of extended downtime, at least 8 hours long,\r\nduring which a character sleeps or performs light activity: reading,\r\ntalking, eating, or standing watch for no more than 2 hours. If the rest\r\nis interrupted by a period of strenuous activity---at least 1 hour of\r\nwalking, fighting, casting spells, or similar adventuring activity---the\r\ncharacters must begin the rest again to gain any benefit from it.\r\n\r\nAt the end of a long rest, a character regains all lost hit points. The\r\ncharacter also regains spent Hit Dice, up to a number of dice equal to\r\nhalf of the character's total number of them (minimum of one die). For\r\nexample, if a character has eight Hit Dice, he or she can regain four\r\nspent Hit Dice upon finishing a long rest.\r\n\r\nA character can't benefit from more than one long rest in a 24-hour\r\nperiod, and a character must have at least 1 hit point at the start of\r\nthe rest to gain its benefits.",
  "image": "/assets/gameplay/rest-avatar.png",
  "bg": "/assets/gameplay/gameplay-bg.png"
}
