{
  "name": "Actions in Combat",
  "desc": "When you take your action on your turn, you can take one of the actions\r\npresented here, an action you gained from your class or a special\r\nfeature, or an action that you improvise. Many monsters have action\r\noptions of their own in their stat blocks.\r\n\r\nWhen you describe an action not detailed elsewhere in the rules, the GM\r\ntells you whether that action is possible and what kind of roll you need\r\nto make, if any, to determine success or failure.\r\n\r\nTypes of Actions\r\n----------------\r\n\r\n### Attack\r\n\r\nThe most common action to take in combat is the Attack action, whether\r\nyou are swinging a sword, firing an arrow from a bow, or brawling with\r\nyour fists.\r\n\r\nWith this action, you make one melee or ranged attack. See the \"Making\r\nan Attack\" section for the rules that govern attacks.\r\n\r\nCertain features, such as the Extra Attack feature of the fighter, allow\r\nyou to make more than one attack with this action.\r\n\r\n### Cast a Spell\r\n\r\nSpellcasters such as wizards and clerics, as well as many monsters, have\r\naccess to spells and can use them to great effect in combat. Each spell\r\nhas a casting time, which specifies whether the caster must use an\r\naction, a reaction, minutes, or even hours to cast the spell. Casting a\r\nspell is, therefore, not necessarily an action. Most spells do have a\r\ncasting time of 1 action, so a spellcaster often uses his or her action\r\nin combat to cast such a spell.\r\n\r\n### Dash\r\n\r\nWhen you take the Dash action, you gain extra movement for the current\r\nturn. The increase equals your speed, after applying any modifiers. With\r\na speed of 30 feet, for example, you can move up to 60 feet on your turn\r\nif you dash.\r\n\r\nAny increase or decrease to your speed changes this additional movement\r\nby the same amount. If your speed of 30 feet is reduced to 15 feet, for\r\ninstance, you can move up to 30 feet this turn if you dash.\r\n\r\n### Disengage\r\n\r\nIf you take the Disengage action, your movement doesn't provoke\r\nopportunity attacks for the rest of the turn.\r\n\r\n### Dodge\r\n\r\nWhen you take the Dodge action, you focus entirely on avoiding attacks.\r\nUntil the start of your next turn, any attack roll made against you has\r\ndisadvantage if you can see the attacker, and you make Dexterity saving\r\nthrows with advantage. You lose this benefit if you are\r\nsrd:incapacitated or if your speed drops to 0.\r\n\r\n### Help\r\n\r\nYou can lend your aid to another creature in the completion of a task.\r\nWhen you take the Help action, the creature you aid gains advantage on\r\nthe next ability check it makes to perform the task you are helping\r\nwith, provided that it makes the check before the start of your next\r\nturn.\r\n\r\nAlternatively, you can aid a friendly creature in attacking a creature\r\nwithin 5 feet of you. You feint, distract the target, or in some other\r\nway team up to make your ally's attack more effective. If your ally\r\nattacks the target before your next turn, the first attack roll is made\r\nwith advantage.\r\n\r\n### Hide\r\n\r\nWhen you take the Hide action, you make a Dexterity (Stealth) check in\r\nan attempt to hide, following the rules for hiding. If you succeed, you\r\ngain certain benefits, as described in srd:unseen-attackers-and-targets.\r\n\r\n### Ready\r\n\r\nSometimes you want to get the jump on a foe or wait for a particular\r\ncircumstance before you act. To do so, you can take the Ready action on\r\nyour turn, which lets you act using your reaction before the start of\r\nyour next turn.\r\n\r\nFirst, you decide what perceivable circumstance will trigger your\r\nreaction. Then, you choose the action you will take in response to that\r\ntrigger, or you choose to move up to your speed in response to it.\r\nExamples include \"If the cultist steps on the trapdoor, I'll pull the\r\nlever that opens it,\" and \"If the goblin steps next to me, I move away.\"\r\n\r\nWhen the trigger occurs, you can either take your reaction right after\r\nthe trigger finishes or ignore the trigger. Remember that you can take\r\nonly one reaction per round.\r\n\r\nWhen you ready a spell, you cast it as normal but hold its energy, which\r\nyou release with your reaction when the trigger occurs. To be readied, a\r\nspell must have a casting time of 1 action, and\r\n\r\nholding onto the spell's magic requires concentration. If your\r\nconcentration is broken, the spell dissipates without taking effect. For\r\nexample, if you are concentrating on the srd:web spell and ready\r\nsrd:magic-missile, your srd:web spell ends, and if you take damage\r\nbefore you release srd:magic-missile with your reaction, your\r\nconcentration might be broken.\r\n\r\n### Search\r\n\r\nWhen you take the Search action, you devote your attention to finding\r\nsomething. Depending on the nature of your search, the GM might have you\r\nmake a Wisdom (Perception) check or an Intelligence (Investigation)\r\ncheck.\r\n\r\n### Use an Object\r\n\r\nYou normally interact with an object while doing something else, such as\r\nwhen you draw a sword as part of an attack. When an object requires your\r\naction for its use, you take the Use an Object action. This action is\r\nalso useful when you want to interact with more than one object on your\r\nturn.\r\n",
  "image": "/assets/combat/actions-in-combat-avatar.png",
  "bg": "/assets/combat/combat-bg.png"
}
