{
  "name": "Making an Attack",
  "desc": "Whether you're striking with a melee weapon, firing a weapon at range,\r\nor making an attack roll as part of a spell, an attack has a simple\r\nstructure.\r\n\r\n1.  **Choose a target.** Pick a target within your attack's range: a\r\n    creature, an object, or a location.\r\n2.  **Determine modifiers.** The GM determines whether the target has\r\n    cover and whether you have advantage or disadvantage against the\r\n    target. In addition, spells, special abilities, and other effects\r\n    can apply penalties or bonuses to your attack roll.\r\n3.  **Resolve the attack.** You make the attack roll. On a hit, you roll\r\n    damage, unless the particular attack has rules that specify\r\n    otherwise. Some attacks cause special effects in addition to or\r\n    instead of damage.\r\n\r\nIf there's ever any question whether something you're doing counts as an\r\nattack, the rule is simple: if you're making an attack roll, you're\r\nmaking an attack.\r\n\r\nAttack Rolls\r\n------------\r\n\r\nWhen you make an attack, your attack roll determines whether the attack\r\nhits or misses. To make an attack roll, roll a d20 and add the\r\nappropriate modifiers. If the total of the roll plus modifiers equals or\r\nexceeds the target's Armor Class (AC), the attack hits. The AC of a\r\ncharacter is determined at character creation, whereas the AC of a\r\nmonster is in its stat block.\r\n\r\n### Modifiers to the Roll\r\n\r\nWhen a character makes an attack roll, the two most common modifiers to\r\nthe roll are an ability modifier and the character's proficiency bonus.\r\nWhen a monster makes an attack roll, it uses whatever modifier is\r\nprovided in its stat block.\r\n\r\n**Ability Modifier.** The ability modifier used for a melee weapon\r\nattack is Strength, and the ability modifier used for a ranged weapon\r\nattack is Dexterity. Weapons that have the finesse or thrown property\r\nbreak this rule.\r\n\r\nSome spells also require an attack roll. The ability modifier used for a\r\nspell attack depends on the spellcasting ability of the spellcaster.\r\n\r\n**Proficiency Bonus.** You add your proficiency bonus to your attack\r\nroll when you attack using a weapon with which you have proficiency, as\r\nwell as when you attack with a spell.\r\n\r\n### Rolling 1 or 20\r\n\r\nSometimes fate blesses or curses a combatant, causing the novice to hit\r\nand the veteran to miss.\r\n\r\nUnseen Attackers and Targets\r\n----------------------------\r\n\r\nCombatants often try to escape their foes' notice by hiding, casting the\r\ninvisibility spell, or lurking in darkness.\r\n\r\nWhen you attack a target that you can't see, you have disadvantage on\r\nthe attack roll. This is true whether you're guessing the target's\r\nlocation or you're targeting a creature you can hear but not see. If the\r\ntarget isn't in the location you targeted, you automatically miss, but\r\nthe GM typically just says that the attack missed, not whether you\r\nguessed the target's location correctly.\r\n\r\nWhen a creature can't see you, you have advantage on attack rolls\r\nagainst it. If you are hidden---both unseen and unheard---when you make\r\nan attack, you give away your location when the attack hits or misses.\r\n\r\nRanged Attacks\r\n--------------\r\n\r\nWhen you make a ranged attack, you fire a bow or a crossbow, hurl a\r\nhandaxe, or otherwise send projectiles to strike a foe at a distance. A\r\nmonster might shoot spines from its tail. Many spells also involve\r\nmaking a ranged attack.\r\n\r\n### Range\r\n\r\nYou can make ranged attacks only against targets within a specified\r\nrange.\r\n\r\nIf a ranged attack, such as one made with a spell, has a single range,\r\nyou can't attack a target beyond this range.\r\n\r\nSome ranged attacks, such as those made with a longbow or a shortbow,\r\nhave two ranges. The smaller number is the normal range, and the larger\r\nnumber is the long range. Your attack roll has disadvantage when your\r\ntarget is beyond normal range, and you can't attack a target beyond the\r\nlong range.\r\n\r\n### Ranged Attacks in Close Combat\r\n\r\nAiming a ranged attack is more difficult when a foe is next to you. When\r\nyou make a ranged attack with a weapon, a spell, or some other means,\r\nyou have disadvantage on the attack roll if you are within 5 feet of a\r\nhostile creature who can see you and who isn't srd:incapacitated.\r\n\r\nMelee Attacks\r\n-------------\r\n\r\nUsed in hand-to-hand combat, a melee attack allows you to attack a foe\r\nwithin your reach. A melee attack typically uses a handheld weapon such\r\nas a sword, a warhammer, or an axe. A typical monster makes a melee\r\nattack when it strikes with its claws, horns, teeth, tentacles, or other\r\nbody part. A few spells also involve making a melee attack.\r\n\r\nMost creatures have a 5-foot **reach** and can thus attack targets\r\nwithin 5 feet of them when making a melee attack. Certain creatures\r\n(typically those larger than Medium) have melee attacks with a greater\r\nreach than 5 feet, as noted in their descriptions.\r\n\r\nInstead of using a weapon to make a melee weapon attack, you can use an\r\n**unarmed strike**: a punch, kick, head-butt, or similar forceful blow\r\n(none of which count as weapons). On a hit, an unarmed strike deals\r\nbludgeoning damage equal to 1 + your Strength modifier. You are\r\nproficient with your unarmed strikes.\r\n\r\n### Opportunity Attacks\r\n\r\nIn a fight, everyone is constantly watching for a chance to strike an\r\nenemy who is fleeing or passing by. Such a strike is called an\r\nopportunity attack.\r\n\r\nYou can make an opportunity attack when a hostile creature that you can\r\nsee moves out of your reach. To make the opportunity attack, you use\r\nyour reaction to make one melee attack against the provoking creature.\r\nThe attack occurs right before the creature leaves your reach.\r\n\r\nYou can avoid provoking an opportunity attack by taking the Disengage\r\naction. You also don't provoke an opportunity attack when you teleport\r\nor when someone or something moves you without using your movement,\r\naction, or reaction. For example, you don't provoke an opportunity\r\nattack if an explosion hurls you out of a foe's reach or if gravity\r\ncauses you to fall past an enemy.\r\n\r\n### Two-Weapon Fighting\r\n\r\nWhen you take the Attack action and attack with a light melee weapon\r\nthat you're holding in one hand, you can use a bonus action to attack\r\nwith a different light melee weapon that you're holding in the other\r\nhand. You don't add your ability modifier to the damage of the bonus\r\nattack, unless that modifier is negative.\r\n\r\nIf either weapon has the thrown property, you can throw the weapon,\r\ninstead of making a melee attack with it.\r\n\r\n### Grappling\r\n\r\nWhen you want to grab a creature or wrestle with it, you can use the\r\nAttack action to make a special melee attack, a grapple. If you're able\r\nto make multiple attacks with the Attack action, this attack replaces\r\none of them.\r\n\r\nThe target of your grapple must be no more than one size larger than you\r\nand must be within your reach. Using at least one free hand, you try to\r\nseize the target by making a grapple check instead of an attack roll: a\r\nStrength (Athletics) check contested by the target's Strength\r\n(Athletics) or Dexterity (Acrobatics) check (the target chooses the\r\nability to use). If you succeed, you subject the target to the\r\nsrd:grappled condition. The condition specifies the things that end it,\r\nand you can release the target whenever you like (no action required).\r\n\r\n**Escaping a Grapple.** A grappled creature can use its action to\r\nescape. To do so, it must succeed on a Strength (Athletics) or Dexterity\r\n(Acrobatics) check contested by your Strength (Athletics) check.\r\n\r\n**Moving a Grappled Creature.** When you move, you can drag or carry the\r\ngrappled creature with you, but your speed is halved, unless the\r\ncreature is two or more sizes smaller than you.\r\n\r\n> **Contests in Combat**\r\n>\r\n> Battle often involves pitting your prowess against that of your foe.\r\n> Such a challenge is represented by a contest. This section includes\r\n> the most common contests that require an action in combat: grappling\r\n> and shoving a creature. The GM can use these contests as models for\r\n> improvising others.\r\n\r\n### Shoving a Creature\r\n\r\nUsing the Attack action, you can make a special melee attack to shove a\r\ncreature, either to knock it srd:prone or push it away from you. If\r\nyou're able to make multiple attacks with the Attack action, this attack\r\nreplaces one of them.\r\n\r\nThe target must be no more than one size larger than you and must be\r\nwithin your reach. Instead of making an attack roll, you make a Strength\r\n(Athletics) check contested by the target's Strength (Athletics) or\r\nDexterity (Acrobatics) check (the target chooses the ability to use). If\r\nyou win the contest, you either knock the target srd:prone or push it 5\r\nfeet away from you.",
  "image": "/assets/combat/attacking-avatar.png",
  "bg": "/assets/combat/combat-bg.png"
}
