{
  "name": "Damage and Healing",
  "desc": "Injury and the risk of death are constant companions of those who\r\nexplore fantasy gaming worlds. The thrust of a sword, a well-placed\r\narrow, or a blast of flame from a srd:fireball spell all have the\r\npotential to damage, or even kill, the hardiest of creatures.\r\n\r\nHit Points\r\n----------\r\n\r\nHit points represent a combination of physical and mental durability,\r\nthe will to live, and luck. Creatures with more hit points are more\r\ndifficult to kill. Those with fewer hit points are more fragile.\r\n\r\nA creature's current hit points (usually just called hit points) can be\r\nany number from the creature's hit point maximum down to 0. This number\r\nchanges frequently as a creature takes damage or receives healing.\r\n\r\nWhenever a creature takes damage, that damage is subtracted from its hit\r\npoints. The loss of hit points has no effect on a creature's\r\ncapabilities until the creature drops to 0 hit points.\r\n\r\nDamage Rolls\r\n------------\r\n\r\nEach weapon, spell, and harmful monster ability specifies the damage it\r\ndeals. You roll the damage die or dice, add any modifiers, and apply the\r\ndamage to your target. Magic weapons, special abilities, and other\r\nfactors can grant a bonus to damage. With a penalty, it is possible to\r\ndeal 0 damage, but never negative damage. When attacking with a\r\n**weapon**, you add your ability modifier---the same modifier used for\r\nthe attack roll---to the damage. A **spell** tells you which dice to\r\nroll for damage and whether to add any modifiers.\r\n\r\nIf a spell or other effect deals damage to **more** **than one target**\r\nat the same time, roll the damage once for all of them. For example,\r\nwhen a wizard casts srd:fireball or a cleric casts srd:flame-strike, the\r\nspell's damage is rolled once for all creatures caught in the blast.\r\n\r\n### Critical Hits\r\n\r\nWhen you score a critical hit, you get to roll extra dice for the\r\nattack's damage against the target. Roll all of the attack's damage dice\r\ntwice and add them together. Then add any relevant modifiers as normal.\r\nTo speed up play, you can roll all the damage dice at once.\r\n\r\nFor example, if you score a critical hit with a dagger, roll 2d4 for the\r\ndamage, rather than 1d4, and then add your relevant ability modifier. If\r\nthe attack involves other damage dice, such as from the rogue's Sneak\r\nAttack feature, you roll those dice twice as well.\r\n\r\n### Damage Types\r\n\r\nDifferent attacks, damaging spells, and other harmful effects deal\r\ndifferent types of damage. Damage types have no rules of their own, but\r\nother rules, such as damage resistance, rely on the types.\r\n\r\nThe damage types follow, with examples to help a GM assign a damage type\r\nto a new effect.\r\n\r\n**Acid.** The corrosive spray of a black dragon's breath and the\r\ndissolving enzymes secreted by a black pudding deal acid damage.\r\n\r\n**Bludgeoning.** Blunt force attacks---hammers, falling, constriction,\r\nand the like---deal bludgeoning damage.\r\n\r\n**Cold.** The infernal chill radiating from an ice devil's spear and the\r\nfrigid blast of a white dragon's breath deal cold damage.\r\n\r\n**Fire.** Red dragons breathe fire, and many spells conjure flames to\r\ndeal fire damage.\r\n\r\n**Force.** Force is pure magical energy focused into a damaging form.\r\nMost effects that deal force damage are spells, including *magic\r\nmissile* and *spiritual weapon*.\r\n\r\n**Lightning.** A *lightning bolt* spell and a blue dragon's breath deal\r\nlightning damage.\r\n\r\n**Necrotic.** Necrotic damage, dealt by certain undead and a spell such\r\nas *chill touch*, withers matter and even the soul.\r\n\r\n**Piercing.** Puncturing and impaling attacks, including spears and\r\nmonsters' bites, deal piercing damage.\r\n\r\n**Poison.** Venomous stings and the toxic gas of a green dragon's breath\r\ndeal poison damage.\r\n\r\n**Psychic.** Mental abilities such as a mind flayer's psionic blast deal\r\npsychic damage.\r\n\r\n**Radiant.** Radiant damage, dealt by a cleric's *flame strike* spell or\r\nan angel's smiting weapon, sears the flesh like fire and overloads the\r\nspirit with power.\r\n\r\n**Slashing.** Swords, axes, and monsters' claws deal slashing damage.\r\n\r\n**Thunder.** A concussive burst of sound, such as the effect of the\r\nsrd:thunderwave spell, deals thunder damage.\r\n\r\nDamage Resistance and Vulnerability\r\n-----------------------------------\r\n\r\nSome creatures and objects are exceedingly difficult or unusually easy\r\nto hurt with certain types of damage.\r\n\r\nIf a creature or an object has **resistance** to a damage type, damage\r\nof that type is halved against it. If a creature or an object has\r\n**vulnerability** to a damage type, damage of that type is doubled\r\nagainst it.\r\n\r\nResistance and then vulnerability are applied after all other modifiers\r\nto damage. For example, a creature has resistance to bludgeoning damage\r\nand is hit by an attack that deals 25 bludgeoning damage. The creature\r\nis also within a magical aura that reduces all damage by 5. The 25\r\ndamage is first reduced by 5 and then halved, so the creature takes 10\r\ndamage.\r\n\r\nMultiple instances of resistance or vulnerability that affect the same\r\ndamage type count as only one instance. For example, if a creature has\r\nresistance to fire damage as well as resistance to all nonmagical\r\ndamage, the damage of a nonmagical fire is reduced by half against the\r\ncreature, not reduced by three--- quarters.\r\n\r\nHealing\r\n-------\r\n\r\nUnless it results in death, damage isn't permanent. Even death is\r\nreversible through powerful magic. Rest can restore a creature's hit\r\npoints, and magical methods such as a *cure wounds* spell or a *potion\r\nof healing* can remove damage in an instant.\r\n\r\nWhen a creature receives healing of any kind, hit points regained are\r\nadded to its current hit points. A creature's hit points can't exceed\r\nits hit point maximum, so any hit points regained in excess of this\r\nnumber are lost. For example, a druid grants a ranger 8 hit points of\r\nhealing. If the ranger has 14 current hit points and has a hit point\r\nmaximum of 20, the ranger regains 6 hit points from the druid, not 8.\r\n\r\nA creature that has died can't regain hit points until magic such as the\r\nsrd:revivify spell has restored it to life.\r\n\r\nDropping to 0 Hit Points\r\n------------------------\r\n\r\nWhen you drop to 0 hit points, you either die outright or fall\r\nsrd:unconscious, as explained in the following sections.\r\n\r\n### Instant Death\r\n\r\nMassive damage can kill you instantly. When damage reduces you to 0 hit\r\npoints and there is damage remaining, you die if the remaining damage\r\nequals or exceeds your hit point maximum.\r\n\r\nFor example, a cleric with a maximum of 12 hit points currently has 6\r\nhit points. If she takes 18 damage from an attack, she is reduced to 0\r\nhit points, but 12 damage remains. Because the remaining damage equals\r\nher hit point maximum, the cleric dies.\r\n\r\n### Falling Unconscious\r\n\r\nIf damage reduces you to 0 hit points and fails to kill you, you fall\r\nsrd:unconscious. This unconsciousness ends if you regain any hit points.\r\n\r\n### Death Saving Throws\r\n\r\nWhenever you start your turn with 0 hit points, you must make a special\r\nsaving throw, called a death saving throw, to determine whether you\r\ncreep closer to death or hang onto life. Unlike other saving throws,\r\nthis one isn't tied to any ability score. You are in the hands of fate\r\nnow, aided only by spells and features that improve your chances of\r\nsucceeding on a saving throw.\r\n\r\nRoll a d20. If the roll is 10 or higher, you succeed. Otherwise, you\r\nfail. A success or failure has no effect by itself. On your third\r\nsuccess, you become stable (see below). On your third failure, you die.\r\nThe successes and failures don't need to be consecutive; keep track of\r\nboth until you collect three of a kind. The number of both is reset to\r\nzero when you regain any hit points or become stable.\r\n\r\n**Rolling 1 or 20.** When you make a death saving throw and roll a 1 on\r\nthe d20, it counts as two failures. If you roll a 20 on the d20, you\r\nregain 1 hit point.\r\n\r\n**Damage at 0 Hit Points.** If you take any damage while you have 0 hit\r\npoints, you suffer a death saving throw failure. If the damage is from a\r\ncritical hit, you suffer two failures instead. If the damage equals or\r\nexceeds your hit point maximum, you suffer instant death.\r\n\r\n### Stabilizing a Creature\r\n\r\nThe best way to save a creature with 0 hit points is to heal it. If\r\nhealing is unavailable, the creature can at least be stabilized so that\r\nit isn't killed by a failed death saving throw.\r\n\r\nYou can use your action to administer first aid to an srd:unconscious\r\ncreature and attempt to stabilize it, which requires a successful DC 10\r\nWisdom (Medicine) check. A **stable** creature doesn't make death saving\r\nthrows, even though it has 0 hit points, but it does remain\r\nsrd:unconscious. The creature stops being stable, and must start making\r\ndeath saving throws again, if it takes any damage. A stable creature\r\nthat isn't healed regains 1 hit point after 1d4 hours.\r\n\r\n### Monsters and Death\r\n\r\nMost GMs have a monster die the instant it drops to 0 hit points, rather\r\nthan having it fall srd:unconscious and make death saving throws. Mighty\r\nvillains and special nonplayer characters are common exceptions; the GM\r\nmight have them fall srd:unconscious and follow the same rules as player\r\ncharacters.\r\n\r\nKnocking a Creature Out\r\n-----------------------\r\n\r\nSometimes an attacker wants to incapacitate a foe, rather than deal a\r\nkilling blow. When an attacker reduces a creature to 0 hit points with a\r\nmelee attack, the attacker can knock the creature out. The attacker can\r\nmake this choice the instant the damage is dealt. The creature falls\r\nsrd:unconscious and is stable.\r\n\r\nTemporary Hit Points\r\n--------------------\r\n\r\nSome spells and special abilities confer temporary hit points to a\r\ncreature. Temporary hit points aren't actual hit points; they are a\r\nbuffer against damage, a pool of hit points that protect you from\r\ninjury. When you have temporary hit points and take damage, the\r\ntemporary hit points are lost first, and any leftover damage carries\r\nover to your normal hit points. *For example, if you have 5 temporary\r\nhit points and take 7 damage, you lose the temporary hit points and then\r\ntake 2 damage.* Because temporary hit points are separate from your\r\nactual hit points, they can exceed your hit point maximum. A character\r\ncan, therefore, be at full hit points and receive temporary hit points.\r\n\r\nHealing can't restore temporary hit points, and they can't be added\r\ntogether. If you have temporary hit points and receive more of them, you\r\ndecide whether to keep the ones you have or to gain the new ones. For\r\nexample, if a spell grants you 12 temporary hit points when you already\r\nhave 10, you can have 12 or 10, not 22.\r\n\r\nIf you have 0 hit points, receiving temporary hit points doesn't restore\r\nyou to consciousness or stabilize you. They can still absorb damage\r\ndirected at you while you're in that state, but only true healing can\r\nsave you.\r\n\r\nUnless a feature that grants you temporary hit points has a duration,\r\nthey last until they're depleted or you finish a long rest.",
  "image": "/assets/combat/damage-and-healing-avatar.png",
  "bg": "/assets/combat/combat-bg.png"
}
