{
  "name": "Mounted Combat",
  "desc": "A knight charging into battle on a warhorse, a wizard casting spells\r\nfrom the back of a griffon, or a cleric soaring through the sky on a\r\npegasus all enjoy the benefits of speed and mobility that a mount can\r\nprovide.\r\n\r\nA willing creature that is at least one size larger than you and that\r\nhas an appropriate anatomy can serve as a mount, using the following\r\nrules.\r\n\r\nMounting and Dismounting\r\n------------------------\r\n\r\nOnce during your move, you can mount a creature that is within 5 feet of\r\nyou or dismount. Doing so costs an amount of movement equal to half your\r\nspeed. For example, if your speed is 30 feet, you must spend 15 feet of\r\nmovement to mount a horse. Therefore, you can't mount it if you don't\r\nhave 15 feet of movement left or if your speed is 0.\r\n\r\nIf an effect moves your mount against its will while you're on it, you\r\nmust succeed on a DC 10 Dexterity saving throw or fall off the mount,\r\nlanding srd:prone in a space within 5 feet of it. If you're knocked\r\nsrd:prone while mounted, you must make the same saving throw.\r\n\r\nIf your mount is knocked srd:prone, you can use your reaction to\r\ndismount it as it falls and land on your feet. Otherwise, you are\r\ndismounted and fall srd:prone in a space within 5 feet it.\r\n\r\nControlling a Mount\r\n-------------------\r\n\r\nWhile you're mounted, you have two options. You can either control the\r\nmount or allow it to act independently. Intelligent creatures, such as\r\ndragons, act independently.\r\n\r\nYou can control a mount only if it has been trained to accept a rider.\r\nDomesticated horses, donkeys, and similar creatures are assumed to have\r\nsuch training. The initiative of a controlled mount changes to match\r\nyours when you mount it. It moves as you direct it, and it has only\r\nthree action options: Dash, Disengage, and Dodge. A controlled mount can\r\nmove and act even on the turn that you mount it.\r\n\r\nAn independent mount retains its place in the initiative order. Bearing\r\na rider puts no restrictions on the actions the mount can take, and it\r\nmoves and acts as it wishes. It might flee from combat, rush to attack\r\nand devour a badly injured foe, or otherwise act against your wishes.\r\n\r\nIn either case, if the mount provokes an opportunity attack while you're\r\non it, the attacker can target you or the mount.",
  "image": "/assets/combat/mounted-combat-avatar.png",
  "bg": "/assets/combat/combat-bg.png"
}
