{
  "name": "Movement and Position",
  "desc": "In combat, characters and monsters are in constant motion, often using\r\nmovement and position to gain the upper hand.\r\n\r\nOn your turn, you can move a distance up to your speed. You can use as\r\nmuch or as little of your speed as you like on your turn, following the\r\nrules here.\r\n\r\nYour movement can include jumping, climbing, and swimming. These\r\ndifferent modes of movement can be combined with walking, or they can\r\nconstitute your entire move. However you're moving, you deduct the\r\ndistance of each part of your move from your speed until it is used up\r\nor until you are done moving.\r\n\r\nBreaking Up Your Move\r\n---------------------\r\n\r\nYou can break up your movement on your turn, using some of your speed\r\nbefore and after your action. For example, if you have a speed of 30\r\nfeet, you can move 10 feet, take your action, and then move 20 feet.\r\n\r\n### Moving between Attacks\r\n\r\nIf you take an action that includes more than one weapon attack, you can\r\nbreak up your movement even further by moving between those attacks. For\r\nexample, a fighter who can make two attacks with the Extra Attack\r\nfeature and who has a speed of 25 feet could move 10 feet, make an\r\nattack, move 15 feet, and then attack again.\r\n\r\n### Using Different Speeds\r\n\r\nIf you have more than one speed, such as your walking speed and a flying\r\nspeed, you can switch back and forth between your speeds during your\r\nmove. Whenever you switch, subtract the distance you've already moved\r\nfrom the new speed. The result determines how much farther you can move.\r\nIf the result is 0 or less, you can't use the new speed during the\r\ncurrent move.\r\n\r\nFor example, if you have a speed of 30 and a flying speed of 60 because\r\na wizard cast the srd:fly spell on you, you could fly 20 feet, then walk\r\n10 feet, and then leap into the air to fly 30 feet more.\r\n\r\nDifficult Terrain\r\n-----------------\r\n\r\nCombat rarely takes place in bare rooms or on featureless plains.\r\nBoulder-strewn caverns, briar- choked forests, treacherous\r\nstaircases---the setting of a typical fight contains difficult terrain.\r\n\r\nEvery foot of movement in difficult terrain costs 1 extra foot. This\r\nrule is true even if multiple things in a space count as difficult\r\nterrain.\r\n\r\nLow furniture, rubble, undergrowth, steep stairs, snow, and shallow bogs\r\nare examples of difficult terrain. The space of another creature,\r\nwhether hostile or not, also counts as difficult terrain.\r\n\r\nBeing Prone\r\n-----------\r\n\r\nCombatants often find themselves lying on the ground, either because\r\nthey are knocked down or because they throw themselves down. In the\r\ngame, they are srd:prone.\r\n\r\nYou can **drop prone** without using any of your speed. **Standing up**\r\ntakes more effort; doing so costs an amount of movement equal to half\r\nyour speed. For example, if your speed is 30 feet, you must spend\r\n\r\n15 feet of movement to stand up. You can't stand up if you don't have\r\nenough movement left or if your speed is 0.\r\n\r\nTo move while prone, you must **crawl** or use magic such as\r\nteleportation. Every foot of movement while crawling costs 1 extra foot.\r\nCrawling 1 foot in difficult terrain, therefore, costs 3 feet of\r\nmovement.\r\n\r\nInteracting with Objects Around You\r\n-----------------------------------\r\n\r\nHere are a few examples of the sorts of thing you can do in tandem with\r\nyour movement and action:\r\n\r\n-   draw or sheathe a sword\r\n-   open or close a door\r\n-   withdraw a potion from your backpack\r\n-   pick up a dropped axe\r\n-   take a bauble from a table\r\n-   remove a ring from your finger\r\n-   stuff some food into your mouth\r\n-   plant a banner in the ground\r\n-   fish a few coins from your belt pouch\r\n-   drink all the ale in a flagon\r\n-   throw a lever or a switch\r\n-   pull a torch from a sconce\r\n-   take a book from a shelf you can reach\r\n-   extinguish a small flame\r\n-   don a mask\r\n-   pull the hood of your cloak up and over your head\r\n-   put your ear to a door\r\n-   kick a small stone\r\n-   turn a key in a lock\r\n-   tap the floor with a 10-foot pole\r\n-   hand an item to another character\r\n\r\nMoving Around Other Creatures\r\n-----------------------------\r\n\r\nYou can move through a nonhostile creature's space. In contrast, you can\r\nmove through a hostile creature's space only if the creature is at least\r\ntwo sizes larger or smaller than you. Remember that another creature's\r\nspace is difficult terrain for you.\r\n\r\nWhether a creature is a friend or an enemy, you can't willingly end your\r\nmove in its space.\r\n\r\nIf you leave a hostile creature's reach during your move, you provoke an\r\nopportunity attack \\<srd:opportunity-attacks\\>.\r\n\r\nFlying Movement\r\n---------------\r\n\r\nFlying creatures enjoy many benefits of mobility, but they must also\r\ndeal with the danger of falling. If a flying creature is knocked\r\nsrd:prone, has its speed reduced to 0, or is otherwise deprived of the\r\nability to move, the creature falls, unless it has the ability to\r\n\r\nhover or it is being held aloft by magic, such as by the srd:fly spell.\r\n\r\nCreature Size\r\n-------------\r\n\r\nEach creature takes up a different amount of space. The Size Categories\r\ntable shows how much space a creature of a particular size controls in\r\ncombat. Objects sometimes use the same size categories.\r\n\r\n### Size Categories\r\n\r\n| Size     | Space                                            |\r\n| :------- | :----------------------------------------------- |\r\n| Tiny     | 2½ by 2½ ft.                                     |\r\n| Small    | 5 by 5 ft.                                       |\r\n| Medium   | 5 by 5 ft.                                       |\r\n| Large    | 10 by 10 ft.                                     |\r\n| Huge     | 15 by 15 ft. Gargantuan 20 by 20 ft. or larger   |\r\n\r\n### Space\r\n\r\nA creature's space is the area in feet that it effectively controls in\r\ncombat, not an expression of its physical dimensions. A typical Medium\r\ncreature isn't 5 feet wide, for example, but it does control a space\r\nthat wide. If a Medium hobgoblin stands in a 5-foot-wide doorway, other\r\ncreatures can't get through unless the hobgoblin lets them.\r\n\r\nA creature's space also reflects the area it needs to fight effectively.\r\nFor that reason, there's a limit to the number of creatures that can\r\nsurround another creature in combat. Assuming Medium combatants, eight\r\ncreatures can fit in a 5-foot radius around another one.\r\n\r\nBecause larger creatures take up more space, fewer of them can surround\r\na creature. If five Large creatures crowd around a Medium or smaller\r\none, there's little room for anyone else. In contrast, as many as twenty\r\nMedium creatures can surround a Gargantuan one.\r\n\r\n### Squeezing into a Smaller Space\r\n\r\nA creature can squeeze through a space that is large enough for a\r\ncreature one size smaller than it. Thus, a Large creature can squeeze\r\nthrough a passage that's only 5 feet wide. While squeezing through a\r\nspace, a creature must spend 1 extra foot for every foot it moves there,\r\nand it has disadvantage on attack rolls and Dexterity saving throws.\r\nAttack rolls against the creature have advantage while it's in the\r\nsmaller space.",
  "image": "/assets/combat/movement-in-combat-avatar.png",
  "bg": "/assets/combat/combat-bg.png"
}
